Tekla Open API Reference for Tekla Structures 2025
ClipPlane.UpVector Property
The clip plane up vector in global coordinates (XYZ).
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector UpVector { get; set; }
Public Property UpVector As Vector
	Get
	Set
Property Value
Type: Vector
See Also
Reference
ClipPlane Class
Tekla.Structures.Model.UI Namespace